Ran Plan for project: `seamless-creative-test-dev` dir: `seamless-creative-new` workspace: `dev`

<details><summary>Show Output</summary>

```diff
Switched to workspace "dev".


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_storage_bucket.seamless-bucket["atlantis-dev-test"] will be created
+ resource "google_storage_bucket" "seamless-bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "EUROPE-CENTRAL2"
      + name                        = "atlantis-dev-test"
      + project                     = "snappy-byway-396909"
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


ok
total 36
drwxr-xr-x 3 root root 4096 Aug 24 15:41 .
drwx------ 4 root root 4096 Aug 24 15:41 ..
drwxr-xr-x 3 root root 4096 Aug 24 15:41 .terraform
-rw-r--r-- 1 root root  255 Aug 24 15:41 .terraform.lock.hcl
-rw-r--r-- 1 root root  212 Aug 24 15:41 README.md
-rw-r--r-- 1 root root  741 Aug 24 15:41 main.tf
-rw-r--r-- 1 root root 2687 Aug 24 15:41 seamless-creative-test-dev-dev.tfplan
-rw-r--r-- 1 root root  632 Aug 24 15:41 terraform.tfvars
-rw-r--r-- 1 root root  270 Aug 24 15:41 variables.tf
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p seamless-creative-test-dev`
* :put_litter_in_its_place: To **delete** this plan click [here](https://3b42-34-118-86-71.ngrok-free.app/lock?id=andrew-ito%252Fatlantis-poc%252Fseamless-creative-new%252Fdev)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p seamless-creative-test-dev`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`